# ShowSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPipeFittingAndAccessoryPressureDropUIServer..::..ShowSettings Method
IPipeFittingAndAccessoryPressureDropUIServer Interface See Also
---
Shows the settings UI.
**Namespace:** Autodesk.Revit.UI.Plumbing**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
bool ShowSettings(
	PipeFittingAndAccessoryPressureDropUIData data
)
```

Visual Basic
---
```text
Function ShowSettings ( _
	data As PipeFittingAndAccessoryPressureDropUIData _
) As Boolean
```

Visual C++
---
```text
bool ShowSettings(
	PipeFittingAndAccessoryPressureDropUIData^ data
)
```

# ### Parameters
data
    Type: Autodesk.Revit.UI.Plumbing..::..PipeFittingAndAccessoryPressureDropUIData The input data of the calculation.
# ### Return Value
True if the user makes any changes in the UI, false otherwise.
# See Also
IPipeFittingAndAccessoryPressureDropUIServer Interface
Autodesk.Revit.UI.Plumbing Namespace